{"lang" : "ru", "duration" : "2007 – 2016", "descriptions" : [ { "name" : "Место", "description" : "MultiCharts LLC" }, { "name" : "Должность", "description" : "Программист-разработчик" }, {"name" : "Проекты", "description" : "MultiCharts, MultiCharts .NET [http://www.multicharts.com]"}, {"name" : "Описание", "description" : "Торговая платформа со средствами технического анализа, автоматической и ручной мультиброкерной торговли, с возможностью построения графиков и бэктестинга."}, {"name" : "Технологии", "description" : "С/C++, C#, managed C++, SQL, .NET Framework 2.0-4.5, Win32 API, Multithreading, WTL, STL, boost, ATL, COM, Firebird, WinSock."}, {"name" : "Обязанности", "description" : "Разработка нового функционала для технического анализа фондового рынка. Сбор ,анализ требований и их согласование с заказчиком. Внедрение нового и поддержка существующего функционала. Поддержка клиентских серверных платформ: исследование инцидентов, организация загрузки исторических и реайл-тайм данных."} ] }
{"lang" : "en", "duration" : "2007 – 2016", "descriptions" : [ { "name" : "Сompany", "description" : "MultiCharts LLC" }, { "name" : "Position", "description" : "Software developer" }, {"name" : "Projects", "description" : "MultiCharts, MultiCharts .NET [http://www.multicharts.com]"}, {"name" : "Description" ,"description" : "Trading Platform with technical analysis tools, automatic and manual trading with the possibility of charting and backtesting."}, {"name" : "Technologies", "description" : "С/C++, C#, managed C++, SQL, .NET Framework 2.0-4.5, Win32 API, Multithreading, WTL, STL, boost, ATL, COM, Firebird, WinSock."}, {"name" : "Project role", "description" : "Development new features for the technical analysis of the stock market. Collecting, analyzing requirements and their coordination with the customer. The introduction of new and support existing functionality. Support for client server platforms: analizing of incidents, downloading historical and realtime data."} ] }
{"lang" : "ru", "duration" : "2016 – 2017", "descriptions" : [ { "name" : "Место", "description" : "Olfa Trade (Finastra)" }, { "name" : "Должность", "description" : "Программист-разработчик" }, {"name" : "Проект", "description" : "Seamless FX"}, {"name" : "Описание" ,"description" : "Торговая Форекс платформа для брокеров, банков и прочих институциональных клиентов, которая позволяет эффективно управлять ликвидностью, ордерами и осуществлять полный контроль банковских рисков."}, {"name" : "Технологии", "description" : "Java, Ant, PostreSql, JDBC"}, {"name" : "Обязанности", "description" : "Разработка, внедрение и поддержка серверной части. Анализ требований, оценка сложности и сроков выполнения поставленных задач. Написание, отладка и ревью кода. Проведение технического интервью с кандидатами. Расследование инцидентов. Интеграция со сторонними сервисами."} ] }
{"lang" : "en", "duration" : "2016 – 2017", "descriptions" : [ { "name" : "Сompany", "description" : "Olfa Trade (Finastra)" }, { "name" : "Position", "description" : "Senior Software developer" }, {"name" : "Project", "description" : "Seamless FX"}, {"name" : "Description" ,"description" : "Forex trading platform for brokers, banks and other institutional clients, which allows to effectively manage liquidity, orders and complete control of Bank risks."}, {"name" : "Technologies", "description" : "Java, Ant, PostreSql, JDBC"}, {"name" : "Project role", "description" : "Development, deploying and supporting the back-end. Requirements analysis, estimation of the complexity and timing of implementation of tasks. Writing, debuging and reviewing the code. Technical interview. Investigation of the incidents. Integration with third-party services."} ] }
{"lang" : "ru", "duration" : "2017 – наст. время", "descriptions" : [ { "name" : "Место", "description" : "Сбербанк (СберТех)" }, { "name" : "Должность", "description" : "Руководитель направления" }, {"name" : "Проект", "description" : "Платформа поддержки развития бизнеса (ППРБ)"}, {"name" : "Описание" ,"description" : "Платформа (ППРБ) Сбербанка объединяет в себе процессы миддл- и бэк-офиса банка, создавая технологические компоненты и продуктовые фабрики для оказания услуг клиентам. Эта платформа является одной из ключевых и стратегических в ИТ-инфраструктуре Сбербанка."}, {"name" : "Технологии", "description" : "Java, Spring, Maven, Hibernate, JUnit, Threading, Collections, Concurrency, Apache Kafka, Lucene, Oracle, React JS, Redux, JBoss, Nginx, Jenkins"}, {"name" : "Обязанности", "description" : "Техническое руководство создания автоматизированной системы он-лайн комплаенс проверок контроля санкций. Формирование архитектуры сервиса. Анализ требований; оценка, планирование и контроль выполнения задач. Проведение ревью кода, написание и отладка наиболее сложных и ответственных частей кода. Планирование релизного цикла и осуществление поддержки при внедрениях. Интеграция со сторонними сервисами. Расследование инцидентов. Проведение технического интервью с кандидатами и непосредственное участие в формировании команды."} ] }
{"lang" : "en", "duration" : "2017 – present", "descriptions" : [ { "name" : "Сompany", "description" : "Sberbank" }, { "name" : "Position", "description" : "Head of development" }, {"name" : "Project", "description" : "Business Development Support Platform"}, {"name" : "Description" ,"description" : "Sberbank’s Platform combines the processes of the middle and back office of the bank, creating technological components and product factories to provide services to customers. This platform is one of the key and strategic in Sberbank’s IT infrastructure."}, {"name" : "Technologies", "description" : "Java, Spring, Maven, Hibernate, JUnit, Threading, Collections, Concurrency, Apache Kafka, Lucene, Oracle, React JS, Redux, JBoss, Nginx, Jenkins"}, {"name" : "Project role", "description" : "Technical leadership for development an Automated Online Compliance Control for Sanctions Inspection System. Development architecture of the service. Requirements analysis; estimation, planning and control of tasks implementation. Code review, writing and debugging the most complex and critical parts of the code. Release cycle planning and installation support. Integration with third-party services. Investigation of incidents. Technical interviews with candidates and direct participation in team building."} ] }